framework/src/main/resources/api/soapActions/faculty_SubmitApplication.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<se:Envelope xmlns:se="http://schemas.xmlsoap.org/soap/envelope/">
    <se:Header xmlns:sfns="http://soap.sforce.com/schemas/package/PersonIntegrations">
        <sfns:SessionHeader>
            <sessionId>EC_AUTH_TOKEN</sessionId>
        </sfns:SessionHeader>
    </se:Header>
    <se:Body>
        <PersonInt xmlns="http://soap.sforce.com/schemas/package/PersonIntegrations">
            <FacultyId>EC_FACULTY_ID</FacultyId>
        </PersonInt>
    </se:Body>
</se:Envelope>
